import React, { useState } from "react";
import FilterSection from "./FilterSection.js";

const SessionFilter = ({ session, handleInputChange }) => {

  const periodsWithSessions = [
    {
      period: "Κ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)",
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (03/07/2023 - 06/10/2024)',
        'Σύνοδος Β΄ Σύνοδος (07/10/2024 - )'
      ]
    },
    {
      period: 'ΙΘ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (28/05/2023 - 29/05/2023)'
      ]
    },
    {
      period: 'ΙΗ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (17/07/2019 - 02/10/2020)',
        'Σύνοδος Β΄ Σύνοδος (05/10/2020 - 01/10/2021)',
        'Σύνοδος Γ΄ Σύνοδος (04/10/2021 - 30/09/2022)',
        'Σύνοδος Δ΄ Σύνοδος (03/10/2022 - 22/04/2023)'
      ]
    },
    {
      period: 'ΙΘ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (28/05/2023 - 29/05/2023)'
      ]
    },
    {
      period: 'ΙΖ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (03/10/2015 - 30/09/2016)',
        'Σύνοδος Β΄ Σύνοδος (03/10/2016 - 29/09/2017)',
        'Σύνοδος Γ΄ Σύνοδος (02/10/2017 - 13/07/2018)',
        'Σύνοδος (Α΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2018) (16/07/2018 - 02/08/2018)',
        'Σύνοδος (Β΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2018) (23/08/2018 - 09/09/2018)',
        'Σύνοδος (Γ΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2018) (10/09/2018 - 30/09/2018)',
        'Σύνοδος Δ΄ Σύνοδος (01/10/2018 - 11/06/2019)'
      ]
    },
    {
      period: 'ΙΣΤ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (05/02/2015 - 28/08/2015)'
      ]
    },
    {
      period: 'ΙΕ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (28/06/2012 - 19/07/2013)',
        'Σύνοδος Α΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2013 (23/07/2013 - 26/08/2013)',
        'Σύνοδος Β΄ Σύνοδος (07/10/2013 - 04/06/2014)',
        'Σύνοδος Α΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2014 (17/06/2014 - 10/07/2014)',
        'Σύνοδος Β΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2014 (22/07/2014 - 28/08/2014)',
        'Σύνοδος Γ΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους 2014 (02/09/2014 - 03/10/2014)',
        'Σύνοδος Γ΄ Σύνοδος (06/10/2014 - 30/12/2014)'
      ]
    },
    {
      period: 'ΙΔ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ (17/05/2012 - 18/05/2012)'
      ]
    },
    {
      period: 'ΙΓ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους ’10 (20/07/2010 - 30/07/2010)',
        'Σύνοδος Β΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους ’10 (02/08/2010 - 09/09/2010)',
        'Σύνοδος Γ΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους ’10 (14/09/2010 - 01/10/2010)',
        'Σύνοδος Α΄ Σύνοδος (14/10/2009 - 16/07/2010)',
        'Σύνοδος Β΄ Σύνοδος (04/10/2010 - 30/09/2011)',
        'Σύνοδος Γ΄ Σύνοδος (03/10/2011 - 10/04/2012)'
      ]
    },
    {
      period: 'ΙΒ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος Α΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους ΄09 (16/06/2009 - 09/07/2009)',
        'Σύνοδος Β΄ Τμήμα Διακοπής Εργασιών Βουλής Θέρους ΄09 (14/07/2009 - 03/09/2009)',
        'Σύνοδος (Θέρος ΄08) (08/07/2008 - 03/10/2008)',
        'Σύνοδος Α΄ Σύνοδος (26/09/2007 - 27/06/2008)',
        'Σύνοδος Β΄ Σύνοδος (06/10/2008 - 08/05/2009)'
      ]
    },
    {
      period: 'ΙΑ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος (Θέρος ΄04) (29/06/2004 - 30/09/2004)',
        'Σύνοδος (Θέρος ΄05) (05/07/2005 - 29/09/2005)',
        'Σύνοδος (Θέρος ΄07) (10/07/2007 - 02/08/2007)',
        'Σύνοδος Α΄ (Συνέχιση Ολομέλειας) (04/10/2004 - 01/07/2005)',
        'Σύνοδος Α΄ Σύνοδος (18/03/2004 - 24/06/2004)',
        'Σύνοδος Β΄ Σύνοδος (03/10/2005 - 28/09/2006)',
        'Σύνοδος Γ΄ (02/10/2006 - 06/07/2007)'
      ]
    },
    {
      period: 'Ι΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος (Θέρος ΄00) (12/06/2000 - 28/09/2000)',
        'Σύνοδος (Θέρος ΄01) (25/06/2001 - 27/09/2001)',
        'Σύνοδος (Θέρος ΄02) (02/07/2002 - 03/10/2002)',
        'Σύνοδος (Θέρος ΄03) (01/07/2003 - 02/10/2003)',
        'Σύνοδος Α΄ (Συνέχιση Ολομέλειας) (02/10/2000 - 15/06/2001)',
        'Σύνοδος Α΄ Σύνοδος (20/04/2000 - 31/05/2000)',
        'Σύνοδος Β΄ Σύνοδος (01/10/2001 - 20/06/2002)',
        'Σύνοδος Γ΄ Σύνοδος (07/10/2002 - 19/06/2003)',
        'Σύνοδος Δ΄ Σύνοδος (06/10/2003 - 10/02/2004)'
      ]
    },
    {
      period: 'Θ΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΚΟΙΝΟΒΟΥΛΕΥΤΙΚΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος (Θέρος ΄97) (01/07/1997 - 02/10/1997)',
        'Σύνοδος (Θέρος ΄98) (14/07/1998 - 01/10/1998)',
        'Σύνοδος (Θέρος ΄99) (22/06/1999 - 30/09/1999)',
        'Σύνοδος Α΄ Σύνοδος (07/10/1996 - 13/06/1997)',
        'Σύνοδος Β΄ Σύνοδος (06/10/1997 - 26/06/1998)',
        'Σύνοδος Γ΄ Σύνοδος (05/10/1998 - 28/05/1999)',
        'Σύνοδος Δ΄ Σύνοδος (04/10/1999 - 11/03/2000)'
      ]
    },
    {
      period: 'Η΄ ΠΕΡΙΟΔΟΣ (ΠΡΟΕΔΡΕΥΟΜΕΝΗΣ ΔΗΜΟΚΡΑΤΙΑΣ)',
      sessions: [
        'Σύνοδος (Θέρος ΄95) (13/06/1995 - 28/09/1995)',
        'Σύνοδος (Θέρος ΄96) (09/07/1996 - 22/08/1996)',
        'Σύνοδος Α΄ Σύνοδος (21/10/1993 - 23/09/1994)',
        'Σύνοδος Β΄ Σύνοδος (03/10/1994 - 02/06/1995)',
        'Σύνοδος Γ΄ Σύνοδος (02/10/1995 - 21/06/1996)'
      ]
    },
    {
      period: 'Ζ΄ ΠΕΡΙΟΔΟΣ',
      sessions: [
        'Σύνοδος (Θέρος ΄90) (31/07/1990 - 28/09/1990)',
        'Σύνοδος Α΄ Σύνοδος (21/04/1990 - 23/07/1990)',
        'Σύνοδος Α΄ (Συνέχιση Ολομέλειας) (01/10/1990 - 17/05/1991)',
        'Σύνοδος (Θέρος ΄91) (04/06/1991 - 17/07/1991)',
        'Σύνοδος Έκτακτη Σύνοδος (18/07/1991 - 18/07/1991)',
        'Σύνοδος (Συνέχιση Θέρους ΄91) (23/07/1991 - 03/10/1991)',
        'Σύνοδος Β΄ Σύνοδος (07/10/1991 - 19/06/1992)',
        'Σύνοδος (Θέρος ΄92) (30/06/1992 - 17/07/1992)',
        'Σύνοδος Έκτακτη Σύνοδος (18/07/1992 - 31/07/1992)',
        'Σύνοδος (Συνέχιση Θέρους ΄92) (01/08/1992 - 01/10/1992)',
        'Σύνοδος Γ΄ Σύνοδος (05/10/1992 - 21/05/1993)',
        'Σύνοδος (Θέρος ΄93) (08/06/1993 - 09/09/1993)'
      ]
    },
    {
      period: 'ΣΤ΄ ΠΕΡΙΟΔΟΣ',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (20/11/1989 - 12/03/1990)'
      ]
    },
    {
      period: 'Ε΄ ΠΕΡΙΟΔΟΣ',
      sessions: [
        'Σύνοδος Α΄ Σύνοδος (03/07/1989 - 06/10/1989)'
      ]
    },
    ]

  return (
    <>
      <FilterSection title="Σύνοδος / Περίοδος">
        <select
          id="session-period"
          className="text-xs bg-transparent border-2 border-white text-white w-full"
          value={session}
          onChange={(e) => handleInputChange("session", e.target.value)}
        >
          <option value="">-- Επιλέξτε Σύνοδο / Περίοδο --</option>
          {periodsWithSessions.map((group, index) => (
            <React.Fragment key={index}>
              <option disabled className="bg-white text-black font-bold">
                ── {group.period} ──
              </option>
              {group.sessions.map((sessionLabel, idx) => (
                <option key={idx} value={sessionLabel}>
                  {sessionLabel}
                </option>
              ))}
            </React.Fragment>
          ))}
        </select>
      </FilterSection>
    </>
  );
};

export default SessionFilter;
